[
    {
        "src": "/assets/img/tools/c-sharp.svg",
        "title": "c-sharp",
        "desc": "A modern, object-oriented programming language developed by Microsoft, widely used for backend development and game development with Unity."
    },
    {
        "src": "/assets/img/tools/java.svg",
        "title": "java",
        "desc": "A versatile and platform-independent programming language commonly used in enterprise applications, Android development, and backend systems."
    },
    {
        "src": "/assets/img/tools/nestjs.svg",
        "title": "nestjs",
        "desc": "A progressive Node.js framework for building efficient and scalable server-side applications using TypeScript."
    },
    {
        "src": "/assets/img/tools/spring-boot.svg",
        "title": "spring-boot",
        "desc": "A Java-based framework for building standalone, production-ready Spring applications with minimal configuration."
    },
    {
        "src": "/assets/img/tools/expressjs-1.svg",
        "title": "expressjs",
        "desc": "A fast, minimalist web framework for Node.js used to build APIs and web applications."
    },
    {
        "src": "/assets/img/tools/nodejs.svg",
        "title": "nodejs",
        "desc": "A JavaScript runtime built on Chrome's V8 engine that allows running JavaScript on the server side."
    },
    {
        "src": "/assets/img/tools/laravel.svg",
        "title": "laravel",
        "desc": "A popular PHP framework known for its elegant syntax and powerful features for web application development."
    },
    {
        "src": "/assets/img/tools/php.svg",
        "title": "php",
        "desc": "A widely-used open-source scripting language primarily suited for web development."
    },
    {
        "src": "/assets/img/tools/python.svg",
        "title": "python",
        "desc": "A high-level, versatile programming language known for its simplicity and extensive libraries, used in web development, data science, and AI."
    },
    {
        "src": "/assets/img/tools/mysql.svg",
        "title": "mysql",
        "desc": "A popular open-source relational database management system known for its reliability and scalability."
    },
    {
        "src": "/assets/img/tools/postgresql.svg",
        "title": "postgresql",
        "desc": "An advanced, open-source relational database known for its robustness, extensibility, and SQL compliance."
    },
    {
        "src": "/assets/img/tools/firebase.svg",
        "title": "firebase",
        "desc": "A backend-as-a-service (BaaS) platform by Google providing real-time databases, authentication, and cloud functions."
    },
    {
        "src": "/assets/img/tools/mongodb.svg",
        "title": "mongodb",
        "desc": "A NoSQL database known for its flexibility and scalability, using a document-oriented data model."
    },
    {
        "src": "/assets/img/tools/oracle-1.svg",
        "title": "oracle-1",
        "desc": "No description available for this technology."
    },
    {
        "src": "/assets/img/tools/supabase.svg",
        "title": "supabase",
        "desc": "An open-source alternative to Firebase, providing database, authentication, and storage solutions."
    },
    {
        "src": "/assets/img/tools/redis.svg",
        "title": "redis",
        "desc": "An in-memory key-value store known for high performance, caching, and real-time analytics."
    },
    {
        "src": "/assets/img/tools/canva.svg",
        "title": "canva",
        "desc": "A graphic design tool that allows users to create visuals, social media posts, and presentations easily."
    },
    {
        "src": "/assets/img/tools/figma.svg",
        "title": "figma",
        "desc": "A collaborative design tool for UI/UX, allowing designers to create prototypes and interfaces in real time."
    },
    {
        "src": "/assets/img/tools/illustrator.svg",
        "title": "illustrator",
        "desc": "A vector graphics software by Adobe used for logo design, illustrations, and complex drawings."
    },
    {
        "src": "/assets/img/tools/xd.svg",
        "title": "xd",
        "desc": "Adobe XD is a UI/UX design tool for creating wireframes, prototypes, and user interfaces."
    },
    {
        "src": "/assets/img/tools/photoshop.svg",
        "title": "photoshop",
        "desc": "A powerful raster graphics editor used for image editing, digital painting, and photo manipulation."
    },
    {
        "src": "/assets/img/tools/apace.svg",
        "title": "apace",
        "desc": "No description available for this technology."
    },
    {
        "src": "/assets/img/tools/bash.svg",
        "title": "bash",
        "desc": "A Unix shell and command language used for scripting and automation on Linux systems."
    },
    {
        "src": "/assets/img/tools/netlify.svg",
        "title": "netlify",
        "desc": "A platform for deploying and hosting modern web applications with continuous deployment and serverless functions."
    },
    {
        "src": "/assets/img/tools/vercel-1.svg",
        "title": "vercel",
        "desc": "A platform for deploying and hosting modern web applications with continuous deployment and serverless functions."
    },
    {
        "src": "/assets/img/tools/palo-alto-networks.svg",
        "title": "palo-alto-networks",
        "desc": "A cybersecurity company known for its advanced firewalls and cloud security solutions."
    },
    {
        "src": "/assets/img/tools/passbolt.svg",
        "title": "passbolt",
        "desc": "An open-source password manager designed for teams to securely manage credentials."
    },
    {
        "src": "/assets/img/tools/red-hat.svg",
        "title": "red-hat",
        "desc": "A leading provider of enterprise open-source solutions, including Linux, cloud, and Kubernetes."
    },
    {
        "src": "/assets/img/tools/taiga.svg",
        "title": "taiga",
        "desc": "An agile project management tool designed for developers and designers to track tasks and sprints."
    },
    {
        "src": "/assets/img/tools/azure.svg",
        "title": "azure",
        "desc": "Microsoft's cloud computing platform providing a wide range of services, including AI, databases, and virtual machines."
    },
    {
        "src": "/assets/img/tools/docker.svg",
        "title": "docker",
        "desc": "A containerization platform that enables developers to package applications and dependencies into portable containers."
    },
    {
        "src": "/assets/img/tools/git.svg",
        "title": "git",
        "desc": "A distributed version control system used for tracking changes in source code."
    },
    {
        "src": "/assets/img/tools/github-1.svg",
        "title": "github",
        "desc": "A cloud-based Git repository hosting service for version control and collaboration."
    },
    {
        "src": "/assets/img/tools/gitlab.svg",
        "title": "gitlab",
        "desc": "A DevOps platform providing Git repository hosting, CI/CD pipelines, and project management tools."
    },
    {
        "src": "/assets/img/tools/jenkins.svg",
        "title": "jenkins",
        "desc": "An open-source automation server used for continuous integration and continuous deployment (CI/CD)."
    },
    {
        "src": "/assets/img/tools/kubernets.svg",
        "title": "kubernets",
        "desc": "No description available for this technology."
    },
    {
        "src": "/assets/img/tools/linux-1.svg",
        "title": "linux",
        "desc": "An open-source operating system widely used for servers, cloud computing, and development."
    },
    {
        "src": "/assets/img/tools/nginx.svg",
        "title": "nginx",
        "desc": "A high-performance web server and reverse proxy server known for its scalability and efficiency."
    },
    {
        "src": "/assets/img/tools/angular-svgrepo-com.svg",
        "title": "angular-svgrepo-com",
        "desc": "A TypeScript-based frontend framework for building dynamic web applications."
    },
    {
        "src": "/assets/img/tools/radix-ui-1.svg",
        "title": "radix-ui",
        "desc": "A set of unstyled, accessible UI components for building modern web applications."
    },
    {
        "src": "/assets/img/tools/rxjs.svg",
        "title": "rxjs",
        "desc": "A reactive programming library for handling asynchronous events and data streams in JavaScript."
    },
    {
        "src": "/assets/img/tools/bootstrap-5-logo-icon.svg",
        "title": "bootstrap-5-logo-icon",
        "desc": "A front-end framework for building responsive web applications with pre-designed components."
    },
    {
        "src": "/assets/img/tools/motion-old.svg",
        "title": "motion-old",
        "desc": "A previous version of the Framer Motion animation library for React."
    },
    {
        "src": "/assets/img/tools/framer.svg",
        "title": "framer",
        "desc": "A design and prototyping tool for creating interactive UI animations."
    },
    {
        "src": "/assets/img/tools/jquery.svg",
        "title": "jquery",
        "desc": "A fast, lightweight JavaScript library for DOM manipulation and event handling."
    },
    {
        "src": "/assets/img/tools/ts.svg",
        "title": "ts",
        "desc": "TypeScript, a superset of JavaScript that adds static typing and improves code maintainability."
    },
    {
        "src": "/assets/img/tools/js.svg",
        "title": "js",
        "desc": "JavaScript, a versatile programming language used for web development, backend, and full-stack applications."
    },
    {
        "src": "/assets/img/tools/html.svg",
        "title": "html",
        "desc": "Hypertext Markup Language, the standard language for structuring web pages."
    },
    {
        "src": "/assets/img/tools/css.svg",
        "title": "css",
        "desc": "Cascading Style Sheets, a styling language used to design the visual appearance of web pages."
    },
    {
        "src": "/assets/img/tools/wix-1.svg",
        "title": "wix",
        "desc": "A cloud-based web development platform that allows users to create websites using drag-and-drop tools."
    },
    {
        "src": "/assets/img/tools/tailwind.svg",
        "title": "tailwind",
        "desc": "A utility-first CSS framework that allows rapid UI development with predefined styles."
    },
    {
        "src": "/assets/img/tools/sass.svg",
        "title": "sass",
        "desc": "A CSS preprocessor that extends CSS with variables, nested rules, and mixins."
    },
    {
        "src": "/assets/img/tools/nextjs.svg",
        "title": "nextjs",
        "desc": "A React framework for building server-rendered and static web applications."
    },
    {
        "src": "/assets/img/tools/react.svg",
        "title": "react",
        "desc": "A JavaScript library for building user interfaces, developed by Facebook."
    },
    {
        "src": "/assets/img/tools/redux.svg",
        "title": "redux",
        "desc": "A state management library for JavaScript applications, commonly used with React."
    },
    {
        "src": "/assets/img/tools/microsoft.svg",
        "title": "microsoft",
        "desc": "A technology company known for Windows, Azure, Office 365, and various enterprise solutions."
    },
    {
        "src": "/assets/img/tools/android-studio.svg",
        "title": "android-studio",
        "desc": "An official IDE for Android app development, based on IntelliJ IDEA."
    },
    {
        "src": "/assets/img/tools/murex.svg",
        "title": "murex",
        "desc": "A technology company specializing in trading, risk management, and enterprise financial solutions."
    }
]